# MaterialAssetParamSourceUrl Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MaterialAssetParamSourceUrl Property
ParameterTypeId Class See Also
---
"Source URL"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MaterialAssetParamSourceUrl { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MaterialAssetParamSourceUrl As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MaterialAssetParamSourceUrl {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace